{"data":{"site":{"siteMetadata":{"title":"Portfolio","author":"Om Bharatiya"}},"markdownRemark":{"id":"b4b7333a-3269-517f-9d6b-d0d6ee8944cb","html":"<p>Namaste! I’m a Software Engineer and here to build some resilient softwares and systems. Let me quickly introduce myself without wasting your bytes.</p>\n<!-- end -->\n<h2>I ❤️ to build, else there’s nothing more exciting about me!</h2>\n<p>I written my first code when I was in class 8th. Ever since then, I’ve been obsessed with the idea of solving problems using software systems. I love Physics &#x26; Mathematics as well but am little biased for Computer Science. This was a reason I dropped out from Degree in Physics Hons and got into Computer Science &#x26; Engineering. I have been a well known guy in computer labs in my college and have fond for MOOCs. I write code in C++, Python, Java and JavaScript. Even I learnt C# &#x26; Objective-C out of curiosity to learn app and game development during college.</p>\n<p>My first industrial exposure was with Microsoft, when I was selected for the Student Partner Program and got hands on with Cloud &#x26; AI. Ever since then my love for this field became stronger and I did few Hackathons &#x26; community engagements as well that helped me gain confidence in the field.</p>\n<p>After one hackathon, I got opportunity to intern in the Software Development &#x26; AI team of ISRO and worked on Deep Learning with CNN for Image semantic analysis and applications.</p>\n<p>Later I joined HashedIn, a SaaS product based startup company, and have been a valuable Full Stack developer since then. I play key role in design &#x26; development of Microservice based applications. My day to day job involves developing REST APIs in DJango and Python, building interactive React Applications &#x26; using Docker &#x26; AWS services for deployment. I’ve worked on noSQL databases including InfluxDB, MongoDB, DynamoDB, and RDBs like Postgres for my applications. I’m keen of learning in-depth of systems and models. I see myself as a learner and I always engage myself by enrolling for trending courses and completing.</p>\n<p>Other than being a Software Engineer, I love to get into discussions on Business, Entrepreneurship, Philosophy &#x26; Socialpreneurship.</p>\n<p>I’d prefer to discuss building product and innovative idea on coffee/beer than partying over weekend.</p>","frontmatter":{"title":"Welcome to my Site!","date":"June 25, 2020","featuredImage":{"childImageSharp":{"sizes":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAJABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIDAQT/xAAWAQEBAQAAAAAAAAAAAAAAAAACAAP/2gAMAwEAAhADEAAAAYtDdB0CEP/EABoQAAICAwAAAAAAAAAAAAAAAAACARIiMTL/2gAIAQEAAQUCfGFgqP0mz//EABURAQEAAAAAAAAAAAAAAAAAABBB/9oACAEDAQE/AYf/xAAVEQEBAAAAAAAAAAAAAAAAAAAAEf/aAAgBAgEBPwFX/8QAGhABAAEFAAAAAAAAAAAAAAAAAAECECExUf/aAAgBAQAGPwLLrSlNv//EAB0QAQABAwUAAAAAAAAAAAAAAAEAEBExQVFxobH/2gAIAQEAAT8hRolxaAljDdnFOszw0//aAAwDAQACAAMAAAAQkM//xAAWEQADAAAAAAAAAAAAAAAAAAAAARH/2gAIAQMBAT8QiER//8QAFhEBAQEAAAAAAAAAAAAAAAAAABFh/9oACAECAQE/ENU//8QAHhABAAEDBQEAAAAAAAAAAAAAAQARITEQgZGhweH/2gAIAQEAAT8QXiCpka7QCtQugvNpV9jQHQ9QxP/Z","aspectRatio":2.229032258064516,"src":"/static/about-ombharatiya-d2598895786f850ab9ffde077bd94328-6b3a1.jpeg","srcSet":"/static/about-ombharatiya-d2598895786f850ab9ffde077bd94328-182ff.jpeg 213w,\n/static/about-ombharatiya-d2598895786f850ab9ffde077bd94328-7f5c7.jpeg 425w,\n/static/about-ombharatiya-d2598895786f850ab9ffde077bd94328-6b3a1.jpeg 850w,\n/static/about-ombharatiya-d2598895786f850ab9ffde077bd94328-45cc1.jpeg 1275w,\n/static/about-ombharatiya-d2598895786f850ab9ffde077bd94328-e2e42.jpeg 1382w","sizes":"(max-width: 850px) 100vw, 850px"}}}}}},"pageContext":{"slug":"/about-ombharatiya/","previous":null,"next":null}}